name: "BART"
platform: "onnxruntime_onnx"
backend: "onnxruntime"
max_batch_size: 0  
input [
  { name: "input_ids"         data_type: TYPE_INT64 dims: [ -1, -1 ] },
  { name: "attention_mask"    data_type: TYPE_INT64 dims: [ -1, -1 ] },
  { name: "decoder_input_ids" data_type: TYPE_INT64 dims: [ -1, -1 ] }
]
output [
  { name: "logits"            data_type: TYPE_FP32  dims: [ -1, -1, -1 ] }
]